import { createHash } from 'crypto'
   import PhoneNumber from 'awesome-phonenumber'
   import { canLevelUp, xpRange } from '../lib/levelling.js'
   import fetch from 'node-fetch'
   import fs from 'fs'
   const { levelling } = '../lib/levelling.js'
   import moment from 'moment-timezone'
   import { promises } from 'fs'
   import { join } from 'path'
   const time = moment.tz('Egypt').format('HH')
   let wib = moment.tz('Egypt').format('HH:mm:ss')
   //import db from '../lib/database.js'

   let handler = async (m, { conn, usedPrefix, command}) => {
       let d = new Date(new Date + 3600000)
       let locale = 'en'
       let week = d.toLocaleDateString(locale, { weekday: 'long' })
       let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
       let _uptime = process.uptime() * 1000
       let uptime = clockString(_uptime)
   let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
   if (!(who in global.db.data.users)) throw `✳️ لم يتم العثور على المستخدم في قاعدة البيانات الخاصة بي`
   let videoUrl = 'https://telegra.ph/file/9967e78e23fdd80be8841.mp4'
   let user = global.db.data.users[who]
   let { name, exp, diamond, lastclaim, registered, regTime, age, level, role, warn } = global.db.data.users[who]
   let { min, xp, max } = xpRange(user.level, global.multiplier)
   let username = conn.getName(who)
   let math = max - xp
   let prem = global.prems.includes(who.split`@`[0])
   let sn = createHash('md5').update(who).digest('hex')
   let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
   let more = String.fromCharCode(8206)
   m.react('📃')
   let readMore = more.repeat(850) 
   let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
   let str = `
⋄━───═◞⬪𝑻𝑼𝑹𝑩𝑶 𝑩𝑶𝑻⬪◟═───━⋄
✮ ⃟👑 مـرحــبـا بــك یــا ${taguser} 

✮ ⃟👤≽ مـعـلــومـات الـبــوت╿↶
━ ── • ⟐ • ── ━
🐍✬⃝╿↵ اســم الـبــوت  𝐓𝐔𝐑𝐁𝐎‘ 
🐍✬⃝╿↵ وقــت الـتشـغـيــل : ⌊ ${uptime} ⌉╎
🐍✬⃝╿↵ الـمـطـور : ⌊https://wa.me/201024480189╎
🐍✬⃝╿↵ الـمـطـور : ⌊ https://Solo to boss ⌉╎
🐍✬⃝╿↵ الـإصـدار : ⌊v2.5⌉╎
🐍✬⃝╿↵ مـنـصـة الـتشـغـيــل :  ⌊ 𝑯𝑬𝑹𝑶𝑲𝑼 ⌉╎
🐍✬⃝╿↵ يمكنك دعم البوت عن طريق كتابه .الدعم ⌉╎

 ━ ── • ඬ • ── ━                             
  ≼📃≽ قـسـم المجموعات╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟📃➤ .جروبي⌉
✮ ⃟📃➤ .معلوم_الجروب⌉
✮ ⃟📃➤ .منشن⌉
✮ ⃟📃➤ .مخفي⌉
✮ ⃟📃➤ .طرد⌉
✮ ⃟📃➤ .اضافه⌉
✮ ⃟📃➤ .ترقيه⌉
✮ ⃟📃➤ .خفض⌉
✮ ⃟📃➤ .حذف⌉
✮ ⃟📃➤ .جروب⌉
✮ ⃟📃➤ .تغير_المغادره⌉
✮ ⃟📃➤ .تغير_الدخول⌉
✮ ⃟📃➤ .تغييرالصورة⌉
✮ ⃟📃➤ .تغيير_الوصف⌉
✮ ⃟📃➤ .تغيير_الاسم⌉
✮ ⃟📃➤ .لينك⌉
✮ ⃟📃➤ .رستر⌉
✮ ⃟📃➤ .المشرفين⌉
✮ ⃟📃➤ .انذار⌉
✮ ⃟📃➤ .الغاء_الانذار ⌉
✮ ⃟📃➤ .الانذارات⌉
────── • ඬ • ──────                         
  ≼🌀≽ قـسـم الانمي╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟🌀➤ .فانرت⌉
✮ ⃟🌀➤ .هوسبو⌉
✮ ⃟🌀➤ .كانا⌉
✮ ⃟🌀➤ .ميغومين⌉
✮ ⃟🌀➤ .نيكو⌉
✮ ⃟🌀➤ .شوتا⌉
✮ ⃟🌀➤ .وايف⌉
✮ ⃟🌀➤ .الينا⌉
✮ ⃟🌀➤ .مراتي⌉
✮ ⃟🌀➤ .بنت⌉
────── • ඬ • ──────                        
  ≼📖≽  قـسـم الدين ╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟🕋➤ .ايه-الكرسي⌉
✮ ⃟🕋➤ .الله⌉
✮ ⃟🕋➤ .قران⌉
✮ ⃟🕋➤ .سوره⌉
✮ ⃟🕋➤ .سور⌉
✮ ⃟🕋➤ .حديث⌉
✮ ⃟🕋➤ .ذكر⌉
────── • ඬ • ──────                        
  ≼💎≽ قـسـم البنك╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟💎➤ .البنك⌉
✮ ⃟💎➤ .راتب⌉
✮ ⃟💎➤ .هجوم⌉
✮ ⃟💎➤ .يومي⌉
✮ ⃟💎➤ .الماس⌉
✮ ⃟💎➤ .ترتيب⌉
✮ ⃟💎➤ .ايدي⌉
✮ ⃟💎➤ .لفل⌉
✮ ⃟💎➤ .تسجيل⌉
✮ ⃟💎➤ .الغاء_التسجيل⌉
────── • ඬ • ──────                         
≼📥≽ قـسـم التحميل+البحث╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟📥➤ .فيديو⌉
✮ ⃟📥➤ .فيديو2⌉
✮ ⃟📥➤ .اغنيه⌉
✮ ⃟📥➤ .اغاني⌉
✮ ⃟📥➤ .شغل⌉
✮ ⃟📥➤ .شغل1⌉
✮ ⃟📥➤ .صورة ⌉
✮ ⃟📥➤ .طقم⌉
✮ ⃟📥➤ .طقم_اولاد⌉
✮ ⃟📥➤ .طقم_بنات⌉
✮ ⃟📥➤ .البحث⌉
✮ ⃟📥➤ .ويكيبيديا⌉
✮ ⃟📥➤ .تيك⌉
✮ ⃟📥➤ .تيك_صور⌉
✮ ⃟📥➤ .يوتيوب⌉
✮ ⃟📥➤ .بينترست⌉
✮ ⃟📥➤ .فيسبوك⌉
✮ ⃟📥➤ .تطبيق⌉
✮ ⃟📥➤ .انستا⌉
✮ ⃟📥➤ .خلفيه⌉
✮ ⃟📥➤ .ميديافاير⌉
✮ ⃟📥➤ .مانجا⌉
✮ ⃟📥➤ .فريبيك⌉
✮ ⃟📥➤ .جيف⌉
✮ ⃟📥➤ .بنت⌉
✮ ⃟📥➤ .جوجل⌉
────── • ඬ • ──────
 ≼🕹≽ قـسـم الترفيه╿↶                           
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟🎮➤ .اكس_او⌉
✮ ⃟🎮➤ .كنسل⌉
✮ ⃟🎮➤ .تحدي⌉
✮ ⃟🎮➤ .حرب⌉
✮ ⃟🎮➤ .احزر⌉
✮ ⃟🎮➤ .حظ⌉
✮ ⃟🎮➤ .جميل⌉
✮ ⃟🎮➤ .صفع⌉
✮ ⃟🎮➤ .طبطبه⌉
✮ ⃟🎮➤ .ورع⌉
✮ ⃟🎮➤ .اهبل⌉
✮ ⃟🎮➤ .خروف⌉
✮ ⃟🎮➤ .انطق⌉
✮ ⃟🎮➤ .نسبه⌉
✮ ⃟🎮➤ .لو⌉
✮ ⃟🎮➤ .تويت⌉
✮ ⃟🎮➤ .تاج⌉
✮ ⃟🎮➤ .سؤال⌉
✮ ⃟🎮➤ .اسئلني⌉
✮ ⃟🎮➤  كت⌉
✮ ⃟🎮➤ .شطرنج⌉
✮ ⃟🎮➤ .سلاحي
✮ ⃟🎮➤ .علم⌉
✮ ⃟🎮➤ .نصايح⌉
✮ ⃟🎮➤ .علم⌉
✮ ⃟🎮➤ .عكس⌉
✮ ⃟🎮➤ .تويت⌉
✮ ⃟🎮➤ .مراتي⌉
✮ ⃟🎮➤ .فزوره⌉
✮ ⃟🎮➤ .حروف⌉
✮ ⃟🎮➤ .شخصيه⌉
✮ ⃟🎮➤ .احرجني⌉
✮ ⃟🎮➤ .خمن⌉
✮ ⃟🎮➤ .شاذ⌉
✮ ⃟🎮➤ .فكك⌉
✮ ⃟🎮➤ .المارد⌉
✮ ⃟🎮➤ .ايمو⌉
✮ ⃟🎮➤ .دين⌉
✮ ⃟🎮➤ .كوره⌉
✮ ⃟🎮➤ .رياضيات⌉
────── • ඬ • ──────                         
  ≼♻️≽ قـسـم التحويل╿↶
*⋄━───═◞⬪⋇⬪◟═───━⋄*
✮ ⃟♻️➤ .ملصق⌉
✮ ⃟♻️➤ .حقوق⌉
✮ ⃟♻️➤ .لصورة⌉
✮ ⃟♻️➤ .لفيديو⌉
✮ ⃟♻️➤ .دائري⌉
✮ ⃟♻️➤ .دمج⌉
✮ ⃟♻️➤ .لرابط⌉
✮ ⃟♻️➤ .لصوت⌉
✮ ⃟♻️➤ .لريك⌉
✮ ⃟♻️➤ .تيلجرام⌉
✮ ⃟♻️➤ .حيوان⌉
✮ ⃟♻️➤ .قط⌉
✮ ⃟♻️➤ .كلب⌉
✮ ⃟♻️➤ .ستك⌉
✮ ⃟♻️➤ .لملف⌉
✮ ⃟♻️➤ .نرد⌉
✮ ⃟♻️➤ .لانمي⌉
✮ ⃟♻️➤ .ارسم⌉
────── • ඬ • ──────                          
  ≼⚙️≽ قـسـم الادوات╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟⚙️➤ .لرابط⌉
✮ ⃟⚙️➤ .باركود⌉
✮ ⃟⚙️➤ .ترجمه⌉
✮ ⃟⚙️➤ .فضح⌉
✮ ⃟⚙️➤ .تفريغ⌉
✮ ⃟⚙️➤ .فحص⌉
✮ ⃟⚙️➤ .تكرار⌉
✮ ⃟⚙️➤ .بريد⌉
✮ ⃟⚙️➤ .قص⌉
✮ ⃟⚙️➤ .احسب⌉
✮ ⃟⚙️➤ .جوده⌉
✮ ⃟⚙️➤ .واتس⌉
✮ ⃟⚙️➤ .مطلوب⌉
✮ ⃟⚙️➤ .انسخ⌉
✮ ⃟⚙️➤ .بينغ⌉
────── • ඬ • ──────                        
  ≼🔊≽ قـسـم الصوتيات╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟🔊➤ .عميق⌉
✮ ⃟🔊➤ .منفوخ⌉
✮ ⃟🔊➤ .تخين⌉
✮ ⃟🔊➤ .صاخب⌉
✮ ⃟🔊➤ .سريع⌉
✮ ⃟🔊➤ .رفيع⌉
✮ ⃟🔊➤ .روبوت⌉
✮ ⃟🔊➤ .بطئ⌉
✮ ⃟🔊➤ .ناعم⌉
✮ ⃟🔊➤ .سنجاب⌉
✮ ⃟🔊➤ .مكس⌉
────── • ඬ • ──────                         
  ≼👥≽ قـسـم الاعضاء╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟👥➤ .اختفاء⌉
✮ ⃟👥➤ .ابلاغ⌉
✮ ⃟👥➤ .شوف⌉
✮ ⃟👥➤ .بارد⌉
✮ ⃟👥➤ .سيري⌉
✮ ⃟👥➤ .تحدث⌉
✮ ⃟👥➤ .بوت⌉
✮ ⃟👥➤ .بينغ⌉
✮ ⃟👥➤ .بروفايل⌉
✮ ⃟👥➤ .سرعه⌉
✮ ⃟👥➤ .خط⌉
✮ ⃟👥➤ .هل⌉
✮ ⃟👥➤ .منشني⌉
✮ ⃟👥➤ .توب⌉
✮ ⃟👥➤ .تصاميم⌉
✮ ⃟👥➤ .تصميم⌉
✮ ⃟👥➤ .المطور⌉
✮ ⃟👥➤ .تعليق⌉
✮ ⃟👥➤ .ايديت⌉
✮ ⃟👥➤ .الاستماره⌉
✮ ⃟👥➤ .الدعم⌉
✮ ⃟👥➤ .الطقس⌉
✮ ⃟👥➤ .بوست⌉
✮ ⃟👥➤ .عبارات⌉
✮ ⃟👥➤ .رابطي⌉
✮ ⃟👥➤ .السورس⌉
✮ ⃟👥➤ .قوانين⌉
✮ ⃟👥➤ .المعرف⌉
✮ ⃟👥➤ .المستخدمين⌉
────── • ඬ • ──────                         
  ≼🛡️≽ قـسـم المطور╿↶
⋄━───═◞⬪⋇⬪◟═───━⋄
✮ ⃟🛡️➤ .بان⌉
✮ ⃟🛡️➤ .بانفك⌉
✮ ⃟🛡️➤ .بانشات⌉
✮ ⃟🛡️➤ .بانشاتفك⌉
✮ ⃟🛡️➤ .حطهابروفايل⌉
✮ ⃟🛡️➤ .ضيفالماس⌉
✮ ⃟🛡️➤ .ضيفاكسبي⌉
✮ ⃟🛡️➤ .اعاده⌉
✮ ⃟🛡️➤ .اخرج⌉
✮ ⃟🛡️➤ .ادخل⌉
✮ ⃟🛡️➤ .تهكير⌉
✮ ⃟🛡️➤ .تنظيف⌉
✮ ⃟🛡️➤ .الامردا⌉
✮ ⃟🛡️➤ .البلوكات⌉
✮ ⃟🛡️➤ .فكالبلوك⌉
✮ ⃟🛡️➤ .بلوك⌉
✮ ⃟🛡️➤ .بريم⌉
✮ ⃟🛡️➤ .حذف_بريم⌉
✮ ⃟🛡️➤ .المميزين⌉
✮ ⃟🛡️➤ .تسريع⌉
✮ ⃟🛡️➤ .نشر⌉
⋄━───═◞⬪𝑻𝑼𝑹𝑩𝑶 𝑩𝑶𝑻⬪◟═───━⋄
* للتواصل مع المطور*
✮ ⃟🐦‍🔥➤ .المطور
   `.trim()
       conn.sendMessage(m.chat, {
           video: { url: videoUrl }, caption: str,
     mentions: [m.sender,global.conn.user.jid],
     gifPlayback: true,gifAttribution: 0
       }, { quoted: m });
   };
   handler.help = ['main']
   handler.command = ['المهام'] 

   export default handler
   function clockString(ms) {
       let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
       let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
       let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
       return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}

       function ucapan() {
         const time = moment.tz('Egypt').format('HH')
         let res = "بداية يوم سعيده ☀️"
         if (time >= 4) {
           res = "صباح الخير 🌄"
         }
         if (time >= 10) {
           res = "مساء الخير ☀️"
         }
         if (time >= 15) {
           res = "مساء الخير 🌇"
         }
         if (time >= 18) {
           res = "مساء الخير 🌙"
         }
         return res
     }
